Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/api/container/ab-compute.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /compute
Document Length:        29 bytes

Concurrency Level:      10
Time taken for tests:   53.520 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      173000 bytes
HTML transferred:       29000 bytes
Requests per second:    18.68 [#/sec] (mean)
Time per request:       535.200 [ms] (mean)
Time per request:       53.520 [ms] (mean, across all concurrent requests)
Transfer rate:          3.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:    65  533 117.9    529    1051
Waiting:       64  508 125.5    521    1049
Total:         65  533 117.9    529    1051

Percentage of the requests served within a certain time (ms)
  50%    529
  66%    554
  75%    586
  80%    616
  90%    663
  95%    727
  98%    819
  99%    834
 100%   1051 (longest request)