Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/api/container/ab-health.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /health
Document Length:        20 bytes

Concurrency Level:      100
Time taken for tests:   4.483 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1640000 bytes
HTML transferred:       200000 bytes
Requests per second:    2230.52 [#/sec] (mean)
Time per request:       44.833 [ms] (mean)
Time per request:       0.448 [ms] (mean, across all concurrent requests)
Transfer rate:          357.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.7      0      27
Processing:    17   44  12.1     41     116
Waiting:       10   39  11.0     36     106
Total:         18   45  12.5     41     120

Percentage of the requests served within a certain time (ms)
  50%     41
  66%     46
  75%     49
  80%     52
  90%     61
  95%     70
  98%     81
  99%     91
 100%    120 (longest request)